app/controllers/items_controller.rb

INSERT INTO "items" ("list_id", "updated_at", "created_at", "name", "price") VALUES (2, '2011-07-14 21:20:08.365023', '2011-07-14 21:20:08.365023', 'Led Zeppelin - Houses of the Holy', 15.0)
---
	def create
		@item = Item.new(params[:item])
		@item.save

SELECT "items".* FROM "items" WHERE (id=3) LIMIT 1
---
	def edit
		@title="Editar Item"
		item_id=params[:id]
		@item = Item.first(:conditions=>'id='<<item_id)

SELECT "items".* FROM "items" WHERE "items"."id" = 21 LIMIT 1
UPDATE "items" SET "price" = 2.0, "name" = 'Arroz', "updated_at" = '2011-07-14 21:43:07.743618' WHERE "items"."id" = 21
---
	def update
     	@item = Item.find(params[:id])
        @item.update_attributes(params[:item])

SELECT "items".* FROM "items" WHERE "items"."id" = 2 LIMIT 1
DELETE FROM "items" WHERE "items"."id" = 2
---
	def destroy
		id=params[:id]
		@item=Item.find(id)
		@item.delete